src/InformationRegisters/ОтчетыПереданныеВСПАРК/ОтчетыПереданныеВСПАРК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтчетыПереданныеВСПАРК</name>
  <resources>
    <name>СтатусОтправки</name>
    <type>
      <types>EnumRef.СтатусыОтправкиВСПАРК</types>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеудачныхПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отчет</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ОтправкаРегОтчетовВСПАРКВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаписатьСтатистикуОтправкиБухОтчетностиВСПАРК(Показатель) Экспорт

	//СтатистикаБРО.БухОтчетностьВСПАРК.СогласилисьСразу + 1
	//СтатистикаБРО.БухОтчетностьВСПАРК.ОтказалисьСразу + 1
	//СтатистикаБРО.БухОтчетностьВСПАРК.Передумали + 1
	//СтатистикаБРО.БухОтчетностьВСПАРК.ПревышеноПопыток + 1
	//СтатистикаБРО.БухОтчетностьВСПАРК.ОтказалисьПовторитьОтправкуПослеПревышеноПопыток + 1
	//СтатистикаБРО.БухОтчетностьВСПАРК.СогласилисьПовторитьОтправкуПослеПревышеноПопыток + 1
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЦентрМониторинга") Тогда
		
		МодульЦентрМониторинга = ОбщегоНазначения.ОбщийМодуль("ЦентрМониторинга");
		
		ИмяОперации = "СтатистикаБРО.БухОтчетностьВСПАРК." + Показатель;
		МодульЦентрМониторинга.ЗаписатьОперациюБизнесСтатистики(ИмяОперации, 1);
		
	КонецЕсли;
	
КонецПроцедуры

Функция КоличествоНеудачныхПопыток() Экспорт

	Возврат 20;

КонецФункции
 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтчетыКоторыеНеУдаетсяОтправитьВСПАРК() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтчетыПереданныеВСПАРК.Отчет КАК Отчет
		|ИЗ
		|	РегистрСведений.ОтчетыПереданныеВСПАРК КАК ОтчетыПереданныеВСПАРК
		|ГДЕ
		|	ОтчетыПереданныеВСПАРК.СтатусОтправки = ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиВСПАРК.ВозниклаОшибка)
		|	И ОтчетыПереданныеВСПАРК.КоличествоНеудачныхПопыток >= &КоличествоНеудачныхПопыток";
	
	Запрос.УстановитьПараметр("КоличествоНеудачныхПопыток", ОтправкаРегОтчетовВСПАРКВызовСервера.КоличествоНеудачныхПопыток());
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Отчет");
	
КонецФункции

Функция ОтчетКОтправкеВСПАРК() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтчетыПереданныеВСПАРК.Отчет КАК Отчет
		|ИЗ
		|	РегистрСведений.ОтчетыПереданныеВСПАРК КАК ОтчетыПереданныеВСПАРК
		|ГДЕ
		|	ОтчетыПереданныеВСПАРК.СтатусОтправки = ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиВСПАРК.ВозниклаОшибка)
		|	И ОтчетыПереданныеВСПАРК.КоличествоНеудачныхПопыток < &КоличествоНеудачныхПопыток";
	
	Запрос.УстановитьПараметр("КоличествоНеудачныхПопыток", ОтправкаРегОтчетовВСПАРКВызовСервера.КоличествоНеудачныхПопыток());
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Отчет");
	
КонецФункции

Функция НачатьОтправкуОтчетовВСПАРКВФоне(ДопПараметры) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Отправка отчетов в СПАРК';
															|en = 'Отправка отчетов в СПАРК'");
	ПараметрыВыполнения.ОжидатьЗавершение = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"ОтправкаРегОтчетовВСПАРК.ОтправкаОтчетовВСПАРКВФоне", 
		ДопПараметры, 
		ПараметрыВыполнения);

КонецФункции
	
Процедура ОтправитьОтчетВСПАРКПриНеобходимостиПоТранспортномуСообщениюСервер(ТранспортноеСообщение) Экспорт
	
	НеобходимоОтправить = ОтправкаРегОтчетовВСПАРК.ПроверитьНеобходимостьОтправитьВСПАРКПоТранспортномуСообщению(ТранспортноеСообщение);
	
	Если НеобходимоОтправить Тогда
		Результат = ОтправкаРегОтчетовВСПАРК.ОтправитьОтчетВСПАРКиЗаписатьСтатус(ТранспортноеСообщение.ЦиклОбмена.Предмет);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьОтчетСПАРКВРегистр(
		СсылкаНаОтчет, 
		СтатусОтправки, 
		ОписаниеОшибки = "") Экспорт
		
	ОтправкаРегОтчетовВСПАРК.ЗаписатьОтчетСПАРКВРегистр(
		СсылкаНаОтчет, 
		СтатусОтправки, 
		ОписаниеОшибки);

КонецПроцедуры

Процедура ОбработатьОтчетыУКоторыхЭЦПФНСНеверна() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОтчетыСОшибкой = ОтчетыУКоторыхЭЦПФНСНеверна();
	
	Для каждого Отчет Из ОтчетыСОшибкой Цикл
	
		ЗаписатьОтчетСПАРКВРегистр(
			Отчет, 
			ПредопределенноеЗначение("Перечисление.СтатусыОтправкиВСПАРК.ОтправленУспешно"));
			
		// Исправляем статус отчетов в форме 1С-Отчетность
		Отказ = Ложь;
		РегламентированнаяОтчетность.ЗаписьОбъектовРегламентированнойОтчетности(Отчет, Отказ);
	
	КонецЦикла;
	
КонецПроцедуры

Функция ОтчетыУКоторыхЭЦПФНСНеверна() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтчетыПереданныеВСПАРК.Отчет КАК Отчет
		|ИЗ
		|	РегистрСведений.ОтчетыПереданныеВСПАРК КАК ОтчетыПереданныеВСПАРК
		|ГДЕ
		|	ОтчетыПереданныеВСПАРК.СтатусОтправки = ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиВСПАРК.ВозниклаОшибка)
		|	И ОтчетыПереданныеВСПАРК.ОписаниеОшибки ПОДОБНО ""%математически неверна%""
		|	И ГОД(ОтчетыПереданныеВСПАРК.ДатаДобавления) = 2024";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Отчет");
	
КонецФункции

#КонецОбласти
